artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_preflight_debug_20260330_133050/cases/lumped_solid/0/jellyRoll/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/jellyRoll";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
27144
(
-0.1067452
-0.10748846
-0.10765575
-0.10716453
-0.10677255
-0.097849947
-0.098687878
-0.0981515
...
)
;

boundaryField
{
    jellyRoll_to_cap
    {
        type            calculated;
        value           nonuniform List<scalar> 
1528
(
-0.10690041
-0.10735892
-0.10747887
-0.10711692
-0.10690024
-0.09777745
-0.098488647
-0.097868125
...
)
;
    }
    jellyRoll_to_shell
    {
        type            calculated;
        value           nonuniform List<scalar> 
9976
(
-0.10368386
-0.107195
-0.10625567
-0.1067929
-0.10860029
-0.10753459
-0.1097393
-0.10767739
...
)
;
    }
}


// ************************************************************************* //
