artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_preflight_debug_20260330_133050/cases/lumped_solid/system/ambient/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/ambient";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

passiveAmbient
{
    // chtMultiRegion* solves the energy field (h/he) and derives T from thermo.
    // Use the built-in constraint that converts the desired temperature to the
    // corresponding energy value via thermo.he(p,T).
    type            fixedTemperatureConstraint;
    active          yes;

    selectionMode   all;

    mode            uniform;
    temperature     constant 313.15;
}

// ************************************************************************* //
