artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_preflight_debug_20260330_133050/cases/lumped_solid/system/cap/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/cap";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitTemperature
{
    type            limitTemperature;
    active          no;

    selectionMode   all;

    min             273.15;
    max             473.15;
}

// ************************************************************************* //
